<?php

namespace SadeghPM\SamanBank\Exception;

/**
 * SamanPayVerifyException
 */
class SamanPayVerifyException extends \Exception
{

    function __construct($code = 0)
    {
        parent::__construct($this->translate_code($code), $code);
    }

    public function translate_code($code)
    {
        $trans = [
            -1 => 'خطای در پردازش اطالعات ارسالی.',
            -3 => ' ورودیها حاوی کارکترهای غیرمجاز میباشند.',
            -4 => ' Failed Authentication Merchant ( کلمه عبور یا کد فروشنده اشتباه است(',
            -6 => ' سند قبال برگشت کامل یافته است.',
            -7 => ' رسید دیجیتالی تری است.',
            -8 => ' طوم ورودیها بیشتر از حد مجاز است.',
            -9 => ' وجود کارکترهای غیرمجاز در مبلر برگشتی.',
            -10 => ' رسید دیجیتالی به صورت Base64 نیست )حاوی کارکترهای غیرمجاز است.',
            -11 => ' طوم ورودیها کمتر از حد مجاز است.',
            -12 => ' مبلر برگشتی منفی است.',
            -13 => 'مبلر برگشتی برای برگشت جز ی بیش از مبلر برگشت نخوردهی رسید دیجیتالی
            است.',
            -14 => ' چنین تراکنشی تعریف نشده است.',
            -15 => ' مبلر برگشتی به صورت اعشاری داده شده است.',
            -16 => ' خطای داخلی سیستم',
            -17 => ' برگشت زدن جزیی تراکنش مجاز نمی باشد.',
            -18 => ' Address IP فروشنده نا معتبر است.',
        ];
        return !empty($trans[$code]) ? $trans[$code] : 'خطای تعریف نشده.';
    }
}
